//==============================================================================
//
// コントローラー
// Author : Shimizu Shoji
//
// 操作する。
//
//==============================================================================
#pragma once
#ifndef __H_CCONTROLLER_H__
#define __H_CCONTROLLER_H__
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// class declaration
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CPlayer;

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// class definition
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CController {
 public:
  // ctor
  CController(CPlayer& rPlayer);

  // dtor
  ~CController();

  // Update
  void Update(void);

 private:
  CPlayer& rPlayer_;
};

#endif  // __H_CCONTROLLER_H__
